{
  "file-menu-button": {
    "en": "File",
    "fr": "Fichier"
  },
  "select-template-modal-button": {
    "en": "Select Template",
    "fr": "Sélectionner un modèle"
  },
  "upload-template-dropdown-item": {
    "en": "Upload Template",
    "fr": "Télécharger le modèle"
  },
  "new-dropdown-item": {
    "en": "New",
    "fr": "Nouveau"
  },
  "open-dropdown-item": {
    "en": "Open",
    "fr": "Ouvrir"
  },
  "save-as-dropdown-item": {
    "en": "Save As...",
    "fr": "Enregistrer sous..."
  },
  "export-to-dropdown-item": {
    "en": "Export To...",
    "fr": "Exporter vers..."
  },

  "settings-menu-button": {
    "en": "Settings",
    "fr": "Paramètres"
  },
  "show-all-cols-dropdown-item": {
    "en": "Show all columns",
    "fr": "Afficher toutes les colonnes"
  },
  "show-required-cols-dropdown-item": {
    "en": "Show required columns",
    "fr": "Afficher les colonnes requises"
  },
  "show-recommended-cols-dropdown-item": {
    "en": "Show required + recommended columns",
    "fr": "Afficher les colonnes obligatoires + recommandées"
  },
  "show-all-rows-dropdown-item": {
    "en": "Show all rows",
    "fr": "Afficher toutes les lignes"
  },
  "show-valid-rows-dropdown-item": {
    "en": "Show valid rows",
    "fr": "Afficher les lignes valides"
  },
  "show-invalid-rows-dropdown-item": {
    "en": "Show invalid rows",
    "fr": "Afficher les lignes invalides"
  },
  "show-section-menu": {
    "en": "Show section:",
    "fr": "Afficher la section:"
  },
  "jump-to-dropdown-item": {
    "en": "Jump to...",
    "fr": "Aller à..."
  },
  "fill-dropdown-item": {
    "en": "Fill column...",
    "fr": "Remplir la colonne..."
  },
  "validate-btn": {
    "en": "Validate",
    "fr": "Valider"
  },

  "help-menu-button": {
    "en": "Help",
    "fr": "Aide"
  },
  "getting-started-modal-menu": {
    "en": "Getting Started",
    "fr": "Pour commencer"
  },
  "help_reference": {
    "en": "Reference Guide",
    "fr": "Guide de référence"
  },
  "help_sop": {
    "en": "SOP",
    "fr": "PON"
  },
  "help_release": {
    "en": "Get Latest Release",
    "fr": "Obtenir la dernière version"
  },
  "help_contact": {
    "en": "Contact Us",
    "fr": "Contactez-nous"
  },

  "template_label": {
    "en": "Template",
    "fr": "Modèle"
  },
  "language_label": {
    "en": "Language",
    "fr": "Langue"
  },
  "translation_label": {
    "en": "Language",
    "fr": "Langue"
  },
  "loaded_file_label": {
    "en": "Loaded file",
    "fr": "Fichier téléchargé"
  },
  "add-row": {
    "en": "Add",
    "fr": "Ajouter"
  },
  "add-row-text": {
    "en": "more rows at the bottom",
    "fr": "plus de lignes en bas"
  },
  "template-cancel": {
    "en": "Cancel",
    "fr": "Annuler"
  },
  "template-save": {
    "en": "Save",
    "fr": "Enregistrer"
  },
  "template-continue": {
    "en": "Continue",
    "fr": "Continuer"
  },
  "template-ok": {
    "en": "Ok",
    "fr": "Ok"
  },
  "no-error-button": {
    "en": "No Errors",
    "fr": "Aucune erreur"
  },
  "next-error-button": {
    "en": "Next Error",
    "fr": "Erreur suivante"
  },
  "change-template": {
    "en": "Change Template",
    "fr": "Modifier le modèle"
  },
  "view-template-draft-prompt": {
    "en": "View draft templates",
    "fr": "Afficher les ébauches de modèles"
  },
  "select-template-load": {
    "en": "Open",
    "fr": "Ouvrir"
  },
  "clear-data-prompt": {
    "en": "Clear existing data?",
    "fr": "Effacer les données existantes?"
  },
  "clear-data-confirm-btn": {
    "en": "Clear",
    "fr": "Effacer"
  },
  "save-as-warning": {
    "en": "You have invalid cells. Continue saving?",
    "fr": "Vous avez des cellules invalides. Continuer à enregistrer?"
  },

  "save-as-json-use-index": {
    "en": "Save as object with index key",
    "fr": "Enregistrer comme objet avec clé d’indexation"
  },
  "save-as-json-use-index-key": {
    "en": "Name",
    "fr": "Nom"
  },

  "export-to-invalid-warning": {
    "en": "You have invalid cells. Continue exporting?",
    "fr": "Vous avez des cellules invalides. Continuer l'exportation?"
  },

  "export-to-confirm-btn": {
    "en": "Export",
    "fr": "Exporter"
  },

  "jump-to-input-prompt": {
    "en": "Jump to...",
    "fr": "Aller à..."
  },

  "fill-column-input-prompt": {
    "en": "Fill cells in column ...",
    "fr": "Remplir les cellules dans la colonne..."
  },
  "fill-column-input-part2": {
    "en": "with value",
    "fr": "avec valeur"
  },
  "fill-column-help": {
    "en": "Use this feature to populate all the cells of a column with given value. This won't populate empty rows of the spreadsheet (as occurs when pasting a value to a column's header cell).",
    "fr": "Utilisez cette fonctionnalité pour remplir toutes les cellules d'une colonne avec une valeur donnée. Cela ne remplira pas les lignes vides de la feuille de calcul (comme cela se produit lors du collage d'une valeur dans la cellule d'en-tête d'une colonne)."
  },
  "template-help-title": {
    "en": "Are you ready to harmonize your contextual data?",
    "fr": "Êtes-vous prêt à harmoniser vos données contextuelles?"
  },
  "template-contact-blurb": {
    "en": "",
    "fr": ""
  },
  "dataharmonizer-contact-blurb": {
    "en": "If you have questions about the DataHarmonizer application, or want to notify us of bugs or potential improvements, contact us by either posting an issue at https://github.com/cidgoh/DataHarmonizer/issues or emailing us at emma_griffiths@sfu.ca",
    "fr": "Si vous avez des questions sur l’application DataHarmonizer, ou si vous souhaitez nous informer de bogues ou d’améliorations potentielles, communiquez avec nous en publiant un problème sur https://github.com/Public-Health-Bioinformatics/DataHarmonizer/issues ou en nous envoyant un courriel à l’adresse emma_griffiths@sfu.ca"
  },
  "help-sidebar__column": {
    "en": "Column",
    "fr": "Colonne"
  },
  "help-sidebar__description": {
    "en": "Description",
    "fr": "Description"
  },
  "help-sidebar__examples": {
    "en": "Examples",
    "fr": "Exemples"
  },
  "help-sidebar__guidance": {
    "en": "Guidance",
    "fr": "Conseils"
  },
  "help-sidebar__menus": {
    "en": "Menus",
    "fr": "Menus"
  },
  "reference_guide_title": {
    "en": "Reference Guide for",
    "fr": "Guide de référence pour"
  },
  "reference_guide_msg_pattern_regex": {
    "en": "Pattern as regular expression:",
    "fr": "Motif en tant qu'expression régulière :"
  },
  "reference_guide_msg_pattern_hint": {
    "en": "Pattern hint:",
    "fr": "Indice du motif :"
  },
  "reference_guide_msg_value_comparison": {
    "en": "Value should be",
    "fr": "La valeur doit être"
  },
  "reference_guide_msg_value_comparison_btwn_1": {
    "en": "between",
    "fr": "entre"
  },
  "reference_guide_msg_value_comparison_btwn_2": {
    "en": "and",
    "fr": "et"
  },
  "reference_guide_msg_value_comparison_btwn_3": {
    "en": "(inclusive).",
    "fr": "(inclus)."
  },
  "reference_guide_msg_value_comparison_gte": {
    "en": "greater than or equal to",
    "fr": "supérieure ou égale à"
  },
  "reference_guide_msg_value_comparison_lte": {
    "en": "less than or equal to",
    "fr": "inférieure ou égale à"
  },
  "reference_guide_msg_unique_record": {
    "en": "Each record must have a unique value for this field.",
    "fr": "Chaque enregistrement doit avoir une valeur unique pour ce champ."
  },
  "reference_guide_msg_more_than_one_selection": {
    "en": "More than one selection is allowed.",
    "fr": "Plus d'une sélection est autorisée."
  },
  "carousel-caption-text-0": {
    "en": "The DataHarmonizer contextual data collection template\nand validator application enables users to enter data as\nin an excel spreadsheet - type and pick values from\ndropdowns, copy/paste, add rows, etc. You can edit the cells\nmanually, or upload .xlsx, .xls, .tsv, .csv and .json\nfiles via **File** > **Open**.",
    "fr": "Le modèle de collecte de données contextuelles et l’application de validation DataHarmonizer permettent aux utilisateurs d’entrer des données comme dans une feuille de calcul Excel - taper et choisir des valeurs dans des menus déroulants, copier/coller, ajouter des lignes, etc. Vous pouvez modifier les cellules manuellement, ou télécharger des fichiers .xlsx, .xls, .tsv, .csv et .json dans **Fichier** > **Ouvrir**."
  },
  "carousel-caption-text-1": {
    "en": "The default template loaded is the \"CanCOGeN Covid-19\"\ntemplate. To change the spreadsheet template, select the\nwhite text box to the right of “Template”, it always\ncontains the name of the template currently active, or\nnavigated to “File” followed by “Change Template”. An\nin-app window will appear that allows you to select from\nthe available templates in the drop-down menu. After\nselecting the desired template, click **Open** to activate\nthe template.",
    "fr": "Le modèle par défaut téléchargé est le modèle « CanCOGeN Covid-19 ». Pour changer le modèle de feuille de calcul, sélectionnez la zone de texte blanche à droite de « Modèle », qui contient toujours le nom du modèle actuellement actif, ou naviguez vers « Fichier », puis « Changer de modèle ». Une fenêtre dans l’application apparaîtra, vous permettant de sélectionner parmi les modèles disponibles dans le menu déroulant. Après avoir sélectionné le modèle souhaité, cliquez sur **Ouvrir** pour activer le modèle."
  },
  "carousel-caption-text-2": {
    "en": "Fields are colour-coded; required fields (minimal\nmetadata) are yellow, strongly recommended fields are\npurple, optional fields are white/gray.\n\nYou can toggle between all, the required fields, and the\nrequired + recommended fields by going to “Settings” and\nselecting “Show required columns”, etc.",
    "fr": "Les champs sont codés par couleur; les champs obligatoires (métadonnées minimales) sont en jaune, les champs fortement recommandés sont en violet, les champs optionnels sont en blanc/gris. \n\nVous pouvez basculer entre tous les champs, les champs obligatoires et les champs obligatoires + recommandés en allant dans « Paramètres » et en sélectionnant « Afficher les colonnes obligatoires », etc."
  },
  "carousel-caption-text-3": {
    "en": "Double click on field headers to see the definition of\nthe field, guidance on filling in the field, and\nexamples of how data might look structured according\nto the constraints of the validator.",
    "fr": "Double-cliquez sur les en-têtes de champ pour voir la définition du champ, des conseils pour remplir le champ et des exemples de la manière dont les données pourraient être structurées selon les contraintes du validateur."
  },
  "carousel-caption-text-4": {
    "en": "Picklists of controlled vocabulary are available for\nmany fields. There are dropdown menus for some, and\nmulti-select options for others (e.g. Signs and\nSymptoms). You can also see the list of terms in\nmulti-select columns by clicking once in the\nmulti-select box.",
    "fr": "Des listes de choix de vocabulaire contrôlé sont disponibles pour de nombreux champs. Il y a des menus déroulants pour certains, et des options multisélection pour d’autres (par exemple, les signes et symptômes). Vous pouvez également voir la liste des termes dans les colonnes multisélection en cliquant une fois dans la case multisélection."
  },
  "carousel-caption-text-5": {
    "en": "When you’re done entering your data, you can validate\nvalues by clicking on “Validate”. Errors and missing\ninformation in required fields will be coloured light\nred and dark red, respectively.\n\nYou can navigate to and between errors by clicking the\n“Next Error” button that appears when errors are\npresent. After resolving these errors, revalidate to\nsee if any remain. If there are no more errors the “Next\nError” button will change to “No Errors” and fade away.",
    "fr": "Lorsque vous avez terminé de saisir vos données, vous pouvez valider les valeurs en cliquant sur « Valider ». Les erreurs et les informations manquantes dans les champs obligatoires seront respectivement colorées en rouge clair et rouge foncé.\n\nVous pouvez naviguer vers et entre les erreurs en cliquant sur le bouton « Erreur suivante » qui s’affiche lorsque des erreurs sont présentes. Après avoir résolu ces erreurs, revalidez pour voir s’il en reste. S’il n’y a plus d’erreurs, le bouton « Erreur suivante » se transformera en « Pas d’erreurs » et s’estompera."
  },
  "carousel-caption-text-6": {
    "en": "To facilitate editing data post-validation, you can\nchange your view to only “Show valid rows” or only\n“Show invalid rows” by selecting these options under the\n“Settings” menu. You can select “Show all rows” to return\nto the original view.",
    "fr": "Pour faciliter la modification des données après validation, vous pouvez changer votre vue pour ne montrer que les « lignes valides » ou les « lignes invalides » en sélectionnant ces options dans le menu « Paramètres ». Vous pouvez sélectionner « Afficher toutes les lignes » pour revenir à la vue originale"
  },
  "carousel-caption-text-7": {
    "en": "You can quickly navigate to a section of fields by\nselecting “Settings” and then selecting one of the\noptions listed under “Show section:”.",
    "fr": "Vous pouvez naviguer rapidement vers une section de champs en sélectionnant « Paramètres », puis en sélectionnant l’une des options énumérées sous « Afficher la section : »"
  },
  "carousel-caption-text-8": {
    "en": "You can quickly navigate to a column by selecting\n“Settings” > “Jump to…”. An in-app window will appear,\nselect the desired column header from the drop-down list\nor begin typing its name to narrow down the list options.\nSelecting the column header from the drop down list will\nimmediately relocate you to that column on the spreadsheet.",
    "fr": "Vous pouvez rapidement naviguer vers une colonne en sélectionnant « Paramètres » > « Aller à… ». Une fenêtre dans l’application s’affichera, sélectionnez l’en-tête de colonne souhaitée dans la liste déroulante ou commencez à taper son nom pour affiner les options de la liste. Sélectionner l’en-tête de colonne dans la liste déroulante vous repositionnera immédiatement à cette colonne dans la feuille de calcul."
  },
  "carousel-caption-text-9": {
    "en": "You can also automatically fill a column with a specified\nvalue, but only in rows with corresponding values in the\nfirst “sample ID” column. To use this feature select\n“Settings” > “Fill column...\". Select the desired column\nheader from the drop-down list or begin typing its name to\nnarrow down the list options, then specify the value to\nfill with and click “Ok” to apply.",
    "fr": "Vous pouvez également remplir automatiquement une colonne avec une valeur spécifiée, mais seulement dans les lignes avec des valeurs correspondantes dans la première colonne « ID de l’échantillon ». Pour utiliser cette fonctionnalité, sélectionnez « Paramètres » > « Remplir la colonne... ». Sélectionnez l’en-tête de colonne souhaitée dans la liste déroulante ou commencez à taper son nom pour affiner les options de la liste, puis spécifiez la valeur à remplir et cliquez sur « Ok » pour l’appliquer."
  },
  "carousel-caption-text-10": {
    "en": "When you’ve entered and validated your data, you can\nsave it as a .xlsx, .xls, .tsv, .csv, or .json format\nfile, by clicking on “File” followed by “Save as”.\nYou can also format your data for IRIDA upload (you will\nneed to perform the upload yourself), or use your entered\ndata to create a GISAID submission form (you will need to\nadd additional information, and perform the upload\nyourself), by clicking on \"File\" followed by \"Export\nto\".",
    "fr": "Lorsque vous avez saisi et validé vos données, vous pouvez les enregistrer au format .xlsx, .xls, .tsv, .csv ou .json, en cliquant sur « Fichier », puis sur « Enregistrer sous ». Vous pouvez également formater vos données pour le téléchargement IRIDA (vous devrez effectuer le téléchargement vous-même), ou utiliser vos données saisies pour créer un formulaire de soumission GISAID (vous devrez ajouter des renseignements supplémentaires et effectuer le téléchargement vous-même), en cliquant sur « Fichier », puis sur « Exporter vers »."
  },
  "carousel-caption-text-11": {
    "en": "If your template uses the DataHarmonizer provenance field,\nprovenance information will automatically be added upon\n“Validation” for all rows containing data. Provenance\ninformation includes the DataHarmonizer application version\nnumber, and the template schema version number (if\navailable).",
    "fr": "Si votre modèle utilise le champ de provenance DataHarmonizer, les renseignements de provenance seront automatiquement ajoutés lors de la « validation » pour toutes les lignes contenant des données. Ces renseignements incluent le numéro de version de l’application DataHarmonizer et le numéro de version du schéma du modèle (si disponible)"
  },
  "carousel-caption-text-12": {
    "en": "You can find more information about a template under\nthe “Help” button. “Reference Guide” includes additional\ninformation about fields and the “SOP” (short for Standard\nOperating Procedure) contains additional information about\ncurating data. For a reference guide that includes picklist\nvalues, please contact us.",
    "fr": "Vous pouvez trouver plus de renseignements sur un modèle sous le bouton « Aide ». Le « Guide de référence » inclut des renseignements supplémentaires sur les champs et la « PON » (abréviation de procédure d’opération normalisée) contient des renseignements supplémentaires sur la conservation des données. Pour un guide de référence incluant les valeurs des listes de choix, veuillez communiquer avec nous."
  },
  "carousel-caption-text-13": {
    "en": "Make sure you are using the latest version of the\nDataHarmonizer (and your template). You can check your\ncurrent Data Harmonizer Template version by looking at\nthe bottom of the “Settings” menu. To update your application\nand/or template, open the “Help” menu and select “Get latest\nrelease”.\n\nIf you have questions, or require assistance,\ncontact emma_griffiths@sfu.ca.",
    "fr": "Assurez-vous d’utiliser la dernière version de DataHarmonizer (et de votre modèle). Vous pouvez vérifier votre version actuelle du modèle DataHarmonizer en regardant au bas du menu « Paramètres ». Pour mettre à jour votre application ou votre modèle, ouvrez le menu « Aide » et sélectionnez « Obtenir la dernière version ». \n\nSi vous avez des questions ou avez besoin d’assistance, envoyez un courriel à l’adresse emma_griffiths@sfu.ca."
  },
  "help-sidebar__title": {
    "en": "Column Help",
    "fr": "Aide avec la colonne"
  },
  "help-sidebar__placeholder": {
    "en": "Select a cell to get help for that column.",
    "fr": "Sélectionnez une cellule pour obtenir de l’aide avec cette colonne."
  }
}
